---
kind: method
id: M:Autodesk.Revit.DB.CurveByPoints.GetPoints
source: html/b359ed6c-0944-0ff0-5c15-b39289cb563b.htm
---
# Autodesk.Revit.DB.CurveByPoints.GetPoints Method

Get the sequence of points interpolated by this curve.

## Syntax (C#)
```csharp
public ReferencePointArray GetPoints()
```